# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
    [
      [ -1, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0 p1/2
      [ -1, 2, BasicBlock, [ 64 ] ], # 1 p1/2
      [ -1, 1, Conv, [ 128, 3, 2 ] ], # 2 p2/4
      [ -1, 2, BasicBlock, [ 128 ] ], # 3 p2/4
      [ -1, 1, Conv, [ 256, 3, 2 ] ], # 4 p3/8
      [ -1, 2, BasicBlock, [ 256 ] ], # 5 p3/8
      [ -1, 1, Conv, [ 512, 3, 2 ] ], # 6 p4/16
      [ -1, 2, BasicBlock, [ 512 ] ], # 7 p4/16
      [ -1, 1, Conv, [ 1024, 3, 2 ] ], # 8 p5/32
      [ -1, 2, C3, [ 1024 ] ], # 9 p5/32
      [-1, 1, SimAM, [1024]], # 10
      [-1, 1, SPPF, [1024, 5]] # 11
    ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 15

   [-1, 1, Conv, [256, 1, 1]], # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 20
   [[-1,16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 22 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], # 23
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
